# Создайте и присвойте значение строковой переменной. Выведите ее столько раз, сколько в ней
# символов и разделите пробелами. Программа должна иметь не более двух строк кода.

str = 'labubu'
print(len(str) * (str + " "))